<?php
/*-------------------------------------------------------- tip规范使用说明 ----------------------------------------
 *      以2开头表示请求成功的返回  以5开头表示请求不成功的返回
 * 例子：
 *      20101 （注册成功） 万位的2表示成功操作，千百位的01表示认证相关功能，十个位表示该功能下的某个方法成功提示
 *      50101 （注册失败） 万位的5表示失败操作，千百位的01表示认证相关功能，十个位表示该功能下的某个方法失败提示
 *-----------------------------------------------------------------------------------------------------------------
 * 提示码占位说明：
 * [00]--公用提示 [01]--认证相关 [02]--用户相关 ...
 *
 * */

return  [
//      [20000]--公用成功类提示信息                 [50000]--公用错误类提示信息
        '20000' =>  '操作成功',                     '50000' =>  '操作失败',
        '20001' =>  '请求成功',                     '50001' =>  '请求失败',
        '20002' =>  '添加成功',                     '50002' =>  '添加失败',
        '20003' =>  '删除成功',                     '50003' =>  '删除失败',
        '20004' =>  '修改成功',                     '50004' =>  '修改失败',
        '20005' =>  '下架成功',                     '50005' =>  '下架失败',
        '20006' =>  '初始化成功',                   '50006' =>  '初始化失败',
        '20007' =>  '上传成功',                     '50007' =>  '上传失败',
                                                  '50008' =>  '非法参数',

//      [20100]--认证相关成功提示                   [50100]--认证相关失败提示
        '20101' => '注册成功',                      '50101' => '注册失败',
        '20102' => '登录成功',                      '50102' => '登录失败',
                                                    '50103' => '密码错误',
        '20103' => '找回密码成功',                  '50104' => '找回密码失败',
                                                    '50106' => '账号或密码错误',



];
